<script>
    import Seo from "$lib/components/globals/Seo.svelte";

</script>

<Seo title="Политика конфиденциальности" description="Политика конфиденциальности сайта koltan.dev" type="WebPage" />

<article>
    <div class="wrapper">
        <header>
            <h1>Политика конфиденциальности</h1>
        </header>
        <div class="page-content">
            <div class="wrapper-read">
                <p>Настоящая Политика конфиденциальности является документом, определяющим порядок сбора, использования, хранения и защиты персональных данных пользователей нашего сайта в соответствии с Федеральным законом от 27 июля 2006 года № 152-ФЗ "О персональных данных".</p>

                <h2>1. Сбор и использование персональных данных</h2>

                <p>Контактная форма: Мы используем контактную форму на нашем сайте для сбора информации, включая ваше имя и адрес электронной почты. Мы собираем эти данные для целей обратной связи с вами, ответа на ваши запросы и предоставления информации о наших услугах. Предоставляемая вами информация хранится конфиденциально и не передается третьим лицам без вашего согласия.</p>

                    <p>Ссылки на сбор донатов: Наш сайт может содержать ссылки на стороннюю платформу сбора донатов. Обратите внимание, что при переходе по этим ссылкам вы покидаете наш сайт и переходите на ресурс, который имеет свои собственные условия использования и политику конфиденциальности. Рекомендуется ознакомиться с соответствующей политикой конфиденциальности сторонней платформы, прежде чем предоставлять им вашу персональную информацию.</p>

                        <p>Счетчики посетителей: На нашем сайте установлены счетчики посетителей типа Яндекс.Метрика для анализа использования и поведения пользователей. Счетчики посетителей могут собирать информацию, включая IP-адрес, данные об использовании сайта и другую неличную информацию о посетителях. Данные счетчиков анонимизируются и используются только в обобщенном виде для анализа и улучшения работы нашего сайта.</p>

   <h2>2. Хранение и защита данных</h2>

   <p>Мы осуществляем все необходимые меры для обеспечения сохранности и защиты ваших персональных данных. Мы применяем технические и организационные меры безопасности для предотвращения несанкционированного доступа, использования, изменения или раскрытия вашей информации. Доступ к вашим персональным данным имеют только сотрудники, которым эта информация необходима для выполнения своих рабочих обязанностей.</p>

   <h2>3. Ваши права</h2>

   <p>В рамках закона о персональных данных у вас есть определенные права относительно ваших персональных данных, включая:</p>

   <p>- Право на доступ к вашим персональным данным и получение информации о том, как они используются.</p>
   <p>- Право на исправление или обновление ваших персональных данных, если они неправильны или устарели.</p>
   <p>- Право на удаление ваших персональных данных в случае, если они больше не требуются для целей, для которых они были собраны.</p>
   <p>- Право на ограничение обработки ваших персональных данных в определенных обстоятельствах.</p>
   <p>- Право на возражение против обработки ваших персональных данных на основании легитимных интересов.</p>

   <p>Если у вас есть вопросы, запросы или желание воспользоваться вашими правами, вы можете связаться с нами через контактную информацию, указанную на нашем сайте.</p>

   <h2>4. Изменения политики конфиденциальности</h2>

   <p>Мы сохраняем право время от времени обновлять нашу политику конфиденциальности в соответствии с законодательными требованиями и изменениями в нашей деятельности. Любые изменения политики будут опубликованы на нашем сайте, и вам будет предоставлена информация о важных изменениях, если это требуется.</p>

            </div>

        </div>
    </div>


</article>

<style>
    article {
        margin-top: var(--unit-2);
    }
    h1 {
        font-size: var(--h1);
        text-align: center;
    }
    .page-content {
        margin-top: var(--unit-3);
    }
</style>
