export const works = [
    {
        title: 'Сайт бюро переводов',
        image: "/img/wp.svg",
		year: 2022,
		categories: "WordPress",
		link: "https://188.ru/",
		excerpt: "Обновление сайта многопрофильного бюро переводов на WordPress",
        description: "Заказчик использует на некоторых сайтах виджет рекомендаций от Яндекса, который позволяет показывать ссылки на статьи сайта вместе с рекламой Яндекса. Проблема в том, что система от отечественного поисковика не очень умная и тянет в виджет не только статьи, но и много чего не нужного. Я написал микроплагин, который дает возможность автоматически проставлять специальный тег на страницах, которые не нужно показывать в виджете, а также позволяет исключать некоторые статьи из виджета вручную"
    },
    {
        title: 'Сайт бюро',
        image: "/img/html.svg",
		year: 2023,
		categories: "WordPress",
		link: "https://188.ru/",
		excerpt: "Обновление сайта многопрофильного бюро переводов на WordPress",
        description: "Заказчик использует на некоторых сайтах виджет рекомендаций от Яндекса, который позволяет показывать ссылки на статьи сайта вместе с рекламой Яндекса. Проблема в том, что система от отечественного поисковика не очень умная и тянет в виджет не только статьи, но и много чего не нужного. Я написал микроплагин, который дает возможность автоматически проставлять специальный тег на страницах, которые не нужно показывать в виджете, а также позволяет исключать некоторые статьи из виджета вручную",

    },
    {
        title: 'Сайт переводов',
        image: "/img/js.svg",
		year: 2020,
		categories: "WordPress",
		link: "https://188.ru/",
		excerpt: "Обновление сайта многопрофильного бюро переводов на WordPress",
        description: "Заказчик использует на некоторых сайтах виджет рекомендаций от Яндекса, который позволяет показывать ссылки на статьи сайта вместе с рекламой Яндекса. Проблема в том, что система от отечественного поисковика не очень умная и тянет в виджет не только статьи, но и много чего не нужного. Я написал микроплагин, который дает возможность автоматически проставлять специальный тег на страницах, которые не нужно показывать в виджете, а также позволяет исключать некоторые статьи из виджета вручную",

    },
    {
        title: 'Сайт бюро переводов',
        image: "/img/wp.svg",
		year: 2022,
		categories: "WordPress",
		link: "https://188.ru/",
		excerpt: "Обновление сайта многопрофильного бюро переводов на WordPress",
        description: "Заказчик использует на некоторых сайтах виджет рекомендаций от Яндекса, который позволяет показывать ссылки на статьи сайта вместе с рекламой Яндекса. Проблема в том, что система от отечественного поисковика не очень умная и тянет в виджет не только статьи, но и много чего не нужного. Я написал микроплагин, который дает возможность автоматически проставлять специальный тег на страницах, которые не нужно показывать в виджете, а также позволяет исключать некоторые статьи из виджета вручную"
    },
    {
        title: 'Сайт бюро',
        image: "/img/html.svg",
		year: 2023,
		categories: "WordPress",
		link: "https://188.ru/",
		excerpt: "Обновление сайта многопрофильного бюро переводов на WordPress",
        description: "Заказчик использует на некоторых сайтах виджет рекомендаций от Яндекса, который позволяет показывать ссылки на статьи сайта вместе с рекламой Яндекса. Проблема в том, что система от отечественного поисковика не очень умная и тянет в виджет не только статьи, но и много чего не нужного. Я написал микроплагин, который дает возможность автоматически проставлять специальный тег на страницах, которые не нужно показывать в виджете, а также позволяет исключать некоторые статьи из виджета вручную",

    },
]
