<script>
    import Seo from "$lib/components/globals/Seo.svelte";

</script>

<Seo title="Поддержка автора" description="Можно поддержать меня небольшим переводом" type="WebPage" />

<article>
    <div class="wrapper">
        <header>
            <h1>Поддержать автора</h1>
        </header>
        <div class="page-content">
            <div class="wrapper-read">
                <p>Всем привет! Вы находитесь на сайте, который я сделал в качестве визитной карточки для себя любимого. На нем есть и обычный лендинг, и <a href="/works">портфолио</a>. На нем я публикую свои статьи, где делюсь своими мыслями, наработками, опытом и другими полезными и не очень материалами.</p>
                <p>Этот сайт написан на Svelte - фреймворке, о котором, в том числе, я рассказываю со страниц <a href="/blog">своего блога</a>. В России мало познавательных материалов про этот фреймворк, да и зарубежом про Svelte говорят не так много, по сравнению, например, с React. Я решил писать о нем не потому, что это почти не занятая ниша, а потому что считаю, что разработка на нем - это очень интересно и увлекательно.</p>
                <p>Я - фрилансер. Работаю на себя, и на этом сайте не зарабатываю - здесь нет ни рекламы, ни платных постов, ни проплаченных обзоров. Но под каждой статьей я поставил кликабельный блок, через который можно оставить мне небольшую сумму на развитие. Если и у вас возникнет такое желание, то вы можете перейти <a href="https://yoomoney.ru/to/4100117764019815" target="_blank">на страницу YooMoney</a> и пожертвовать мне любую сумму. Если вам неудобно платить через этот сервис, то напишите мне по любым контактам внизу сайта, или в <a href="https://t.me/KoltanRuFeedBackBot" target="_blank">телеграм-бот</a>. Большое спасибо за поддержку!</p>
            </div>



        </div>
    </div>


</article>

<style>
    article {
        margin-top: var(--unit-2);
    }
    h1 {
        font-size: var(--h1);
        text-align: center;
    }
    .page-content {
        margin-top: var(--unit-3);
    }
</style>
