<script>
    import Seo from "$lib/components/globals/Seo.svelte";
</script>

<Seo title="Обо мне" description="Краткая информация обо мне" type="WebPage" />

<article>
    <div class="wrapper">
        <header>
            <h1>Пара слов обо мне</h1>
        </header>
        <div class="page-content">
            <div class="wrapper-read">
                <p>Меня зовут Леонид Колтан. Я - фрилансер с 2018 года. Работаю с популярными CMS и чистым кодом, c Javascript и JS-фреймворками. Учился на гуманитария и стал технарем. Мне 36 лет и я не с пеленок в IT, но на сегодня в моем портфолио не мало различных проектов, постоянные клиенты и тысячи строк кода.</p>

                <p>Занимаюсь разработкой сайтов на различных платформах и фреймворках. Выполняю работы по верстке, созданию функционала, привязке различных сторонних кодов к сайтам, оптимизации и так далее. Работаю как с чистым кодом (HTML, CSS, JS), так и с CMS (WordPress, Ghost, по-мелочи и с другими), а также с фронтенд-фреймворками и библиотеками (React, NextJS, Gatsby, Svelte).</p>

                <p>Работаю через биржу фриланса, или напрямую. Оплата моих услуг происходит по предварительной договоренности - поэтапно, с предоплатой, или без, с предоставлением счетов и закрывающих документов (через систему для самозанятых) или без этого. Для связи со мной можно воспользоваться ссылками в подвале сайта, написать в <a href="https://t.me/KoltanRuFeedBackBot" target="_blank">телеграм-бот</a>или на <a href="/contact">странице контактов</a>.</p>
            </div>

        </div>
    </div>


</article>

<style>
    article {
        margin-top: var(--unit-2);
    }
    h1 {
        font-size: var(--h1);
        text-align: center;
    }
    .page-content {
        margin-top: var(--unit-3);
    }
</style>
